# Brewfile for dotfiles setup
# Install with: brew bundle --file=Brewfile

# Taps
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Terminal emulators
cask "ghostty"

# Fonts
cask "font-jetbrains-mono"

# Window management & productivity
brew "koekeishiya/formulae/skhd"
cask "nikitabobko/tap/aerospace"

# Shell & prompt
brew "nushell"
brew "starship"
brew "zoxide"  # Smart directory jumper
brew "carapace"  # Multi-shell completion

# Terminal multiplexers
brew "tmux"

# Editor
brew "neovim"
brew "vim"

# Menu bar
brew "FelixKratz/formulae/sketchybar"

# Shell history & tools
brew "atuin"
brew "direnv"
brew "glow"  # Markdown renderer

# File tools
brew "bat"  # Better cat with syntax highlighting
brew "fd"  # Better find
brew "ripgrep"  # Better grep
brew "eza"  # Better ls
brew "fzf"  # Fuzzy finder
brew "tree"  # Directory tree view

# Git tools
brew "git"
brew "gh"  # GitHub CLI
brew "git-delta"  # Better git diff
brew "lazygit"  # Terminal UI for git

# Development tools
brew "go"
brew "node"
brew "python@3.13"
brew "ruby"
brew "rust"

# Kubernetes
brew "kubernetes-cli"

# System monitoring
brew "htop"
brew "bottom"  # Modern htop alternative
brew "procs"  # Modern ps alternative
brew "bandwhich"  # Network monitor
brew "dust"  # Better du

# Utilities
brew "stow"
brew "jq"  # JSON processor
brew "yq"  # YAML processor
brew "wget"
brew "curl"
brew "tokei"  # Code statistics
brew "hyperfine"  # Benchmarking tool
brew "grex"  # Regex generator
brew "sd"  # Better sed
brew "choose"  # Better cut/awk

# Additional developer tools
brew "thefuck"          # Corrects previous command
brew "tldr"             # Better man pages
brew "navi"             # Interactive cheatsheet
brew "httpie"           # Better curl
brew "yazi"             # Blazing fast terminal file manager
brew "ffmpeg"           # For video previews
brew "sevenzip"         # For archive previews
brew "lf"               # Lightweight file manager
brew "nmap"             # Network scanner
brew "speedtest-cli"    # Internet speed test

# Container & orchestration
brew "docker"           # Containerization
brew "docker-compose"   # Multi-container apps
brew "k9s"             # Kubernetes TUI
brew "dive"            # Docker image analyzer
